[
  {
    "year": "1821",
    "text": "Mexico gains independence from Spain, marking the beginning of a complex relationship with the United States as both nations seek to define their identities in a rapidly changing world.",
    "country1": "United States",
    "country2": "Mexico",
    "_id": "66a54854b924215aabf43c31"
  },
  {
    "year": "1823",
    "text": "The United States recognizes Mexico as an independent nation, a significant diplomatic step that establishes formal relations between the two countries in the wake of Mexico's independence.",
    "country1": "United States",
    "country2": "Mexico",
    "_id": "66a54854b924215aabf43c32"
  },
  {
    "year": "1823",
    "text": "United States President James Monroe articulates the Monroe Doctrine in his seventh annual message to Congress, asserting that the Western Hemisphere is off-limits to European colonization and intervention, which indirectly affects U.S.-Mexico relations by framing Mexico as a critical partner in the region.",
    "country1": "United States",
    "country2": "Mexico",
    "_id": "66a54854b924215aabf43c33"
  },
  {
    "year": "1824",
    "text": "Joel Robert Poinsett is appointed the first U.S. minister to Mexico, further formalizing diplomatic ties and opening channels for communication and negotiation between the two nations.",
    "country1": "United States",
    "country2": "Mexico",
    "_id": "66a54854b924215aabf43c34"
  },
  {
    "year": "1825",
    "text": "Over several years, empresario Stephen F. Austin attracts the first 300 American families into the Coahuilas y Tejas territory, leading to increased American influence in Texas and foreshadowing future conflicts over the territory.",
    "country1": "United States",
    "country2": "Mexico",
    "_id": "66a54855b924215aabf43c35"
  },
  {
    "year": "1830",
    "text": "Mexican-owned Tejas is home to roughly 20,000 Americans, indicating a significant American presence that would soon challenge Mexican authority.",
    "country1": "United States",
    "country2": "Mexico",
    "_id": "66a54855b924215aabf43c36"
  },
  {
    "year": "1830",
    "text": "Mexico prohibits immigration to Tejas from the United States in an effort to stop the influx of English-speaking settlers, reflecting growing tensions between the Mexican government and American settlers.",
    "country1": "United States",
    "country2": "Mexico",
    "_id": "66a54855b924215aabf43c37"
  },
  {
    "year": "1835",
    "text": "American immigrants and Tejanos lead the Texas Revolution on behalf of the Tejas province of Mexico as part of a larger Mexican Federalist's War, illustrating the internal divisions within Mexico that the United States would later exploit.",
    "country1": "United States",
    "country2": "Mexico",
    "_id": "66a54855b924215aabf43c38"
  },
  {
    "year": "1836",
    "text": "The Battle of the Alamo occurs, where Texan forces resist Mexican troops; this battle becomes a rallying cry for Texan independence and highlights the conflict between American settlers and Mexican authorities.",
    "country1": "United States",
    "country2": "Mexico",
    "_id": "66a54855b924215aabf43c39"
  },
  {
    "year": "1836",
    "text": "An independent Republic of Texas is declared during the Texas Convention, a pivotal moment that leads to a redefinition of borders and sovereignty in North America.",
    "country1": "United States",
    "country2": "Mexico",
    "_id": "66a54855b924215aabf43c3a"
  },
  {
    "year": "1836",
    "text": "Santa Anna surrenders after defeat in the Battle of San Jacinto; Treaties of Velasco unofficially marks the Rio Grande as the border between Mexico and the Republic of Texas, setting the stage for future U.S. claims.",
    "country1": "United States",
    "country2": "Mexico",
    "_id": "66a54855b924215aabf43c3b"
  },
  {
    "year": "1838",
    "text": "Mexico defends itself successfully from French invasion during the 'Pastry War'; Santa Anna's military success helps him regain popularity but strains relations with the United States, which had its own interests in the region.",
    "country1": "United States",
    "country2": "Mexico",
    "_id": "66a54855b924215aabf43c3c"
  },
  {
    "year": "1841",
    "text": "Santa Anna returns to the Mexican presidency, ordering the military to pressure the Mexican-Texas border, reflecting the ongoing tension and instability in the region.",
    "country1": "United States",
    "country2": "Mexico",
    "_id": "66a54855b924215aabf43c3d"
  },
  {
    "year": "1842",
    "text": "San Antonio is taken and returned several times; a back-and-forth of Mexican militants and Tejanos crossing the border for raids and returning to Mexico continues, illustrating the chaotic nature of border relations.",
    "country1": "United States",
    "country2": "Mexico",
    "_id": "66a54855b924215aabf43c3e"
  },
  {
    "year": "1845",
    "text": "Expansionist Democrat James K. Polk becomes U.S. President, bringing a strong pro-expansionist agenda that would directly challenge Mexican sovereignty.",
    "country1": "United States",
    "country2": "Mexico",
    "_id": "66a54855b924215aabf43c3f"
  },
  {
    "year": "1845",
    "text": "Mexico refuses to negotiate the acceptance of Texas' annexation into the United States, a refusal that escalates tensions and sets the stage for conflict.",
    "country1": "United States",
    "country2": "Mexico",
    "_id": "66a54855b924215aabf43c40"
  },
  {
    "year": "1845",
    "text": "The Republic of Texas is annexed into the United States as the 28th state, a move that Mexico views as an act of aggression and a direct challenge to its territorial integrity.",
    "country1": "United States",
    "country2": "Mexico",
    "_id": "66a54855b924215aabf43c41"
  },
  {
    "year": "1846",
    "text": "President James K. Polk orders General Zachary Taylor to occupy disputed territory between the Nueces and Rio Grande rivers, further inflaming tensions and leading to military confrontation.",
    "country1": "United States",
    "country2": "Mexico",
    "_id": "66a54855b924215aabf43c42"
  },
  {
    "year": "1846",
    "text": "Mexican troops at Matamoros cross the Rio Grande and ambush an American patrol, which President Polk declares an act of war, officially igniting the Mexican-American War.",
    "country1": "United States",
    "country2": "Mexico",
    "_id": "66a54855b924215aabf43c43"
  },
  {
    "year": "1846",
    "text": "The Mexican-American War begins, driven by U.S. expansionist desires and resulting in significant military conflict that would reshape North America.",
    "country1": "United States",
    "country2": "Mexico",
    "_id": "66a54855b924215aabf43c44"
  },
  {
    "year": "1847",
    "text": "The United States army marches towards Mexico City from the north while the United States navy takes Veracruz via amphibious assault, demonstrating the military superiority of the U.S. forces.",
    "country1": "United States",
    "country2": "Mexico",
    "_id": "66a54855b924215aabf43c45"
  },
  {
    "year": "1847",
    "text": "The United States army takes and occupies Mexico City, marking a decisive victory that effectively ends major hostilities in the war.",
    "country1": "United States",
    "country2": "Mexico",
    "_id": "66a54855b924215aabf43c46"
  },
  {
    "year": "1848",
    "text": "The Treaty of Guadalupe Hidalgo is signed, ending the Mexican-American War. The treaty cedes a vast portion of Mexican territory to the United States, including present-day California, Arizona, New Mexico, and parts of Colorado, Utah, and Nevada.",
    "country1": "United States",
    "country2": "Mexico",
    "_id": "66a54855b924215aabf43c47"
  },
  {
    "year": "1854",
    "text": "The Gadsden Purchase is finalized and signed, forming the current-day borders between the United States and Mexico, allowing for a southern transcontinental railroad route and further solidifying U.S. territorial claims.",
    "country1": "United States",
    "country2": "Mexico",
    "_id": "66a54855b924215aabf43c48"
  },
  {
    "year": "1861",
    "text": "-1867 Invoking the Monroe Doctrine, the United States provides diplomatic and material support to Mexico during the French Intervention in Mexico, reflecting U.S. interests in preventing European re-colonization in the Americas.",
    "country1": "United States",
    "country2": "Mexico",
    "_id": "66a54856b924215aabf43c49"
  },
  {
    "year": "1870",
    "text": "s-1890s Mexico encourages repatriation of Mexican-Americans back into its northern territories, a response to the economic and social changes occurring in both nations.",
    "country1": "United States",
    "country2": "Mexico",
    "_id": "66a54856b924215aabf43c4a"
  },
  {
    "year": "1876",
    "text": "Porfirio Díaz seizes power in Mexico with the financial support of U.S. entrepreneurs from South Texas, leading to a close but complex relationship between the two nations characterized by economic exploitation and political manipulation.",
    "country1": "United States",
    "country2": "Mexico",
    "_id": "66a54856b924215aabf43c4b"
  },
  {
    "year": "1884",
    "text": "-1990s The Porfiriato government strengthens U.S.-Mexico economic ties through mining and railroad investments, creating a dependency that benefits U.S. investors while fostering resentment among Mexicans.",
    "country1": "United States",
    "country2": "Mexico",
    "_id": "66a54856b924215aabf43c4c"
  },
  {
    "year": "1910",
    "text": "-1917 Discontent with the Porfiriato leads to the Mexican Revolution, during which U.S. involvement and interventions strain relations as the U.S. navigates the complexities of Mexican politics.",
    "country1": "United States",
    "country2": "Mexico",
    "_id": "66a54856b924215aabf43c4d"
  },
  {
    "year": "1913",
    "text": "The 'Pact of the Embassy' is brokered by U.S. ambassador Henry Lane Wilson to Mexico, leading to Francisco Madero's assassination and Victoriano Huerta's ascension to the Mexican presidency, reflecting U.S. meddling in Mexican internal affairs.",
    "country1": "United States",
    "country2": "Mexico",
    "_id": "66a54856b924215aabf43c4e"
  },
  {
    "year": "1913",
    "text": "Woodrow Wilson is elected President of the United States and embargoes weapons and supplies to Huerta's Mexican Federalist troops, signaling a shift toward support for revolutionary factions opposed to Huerta.",
    "country1": "United States",
    "country2": "Mexico",
    "_id": "66a54856b924215aabf43c4f"
  },
  {
    "year": "1914",
    "text": "President Wilson sends U.S. marines to occupy Mexico's port of Veracruz, heightening tensions between the two countries and demonstrating the U.S.'s willingness to use military force to influence Mexican affairs.",
    "country1": "United States",
    "country2": "Mexico",
    "_id": "66a54856b924215aabf43c50"
  },
  {
    "year": "1916",
    "text": "President Wilson orders the Pancho Villa Expedition, which ultimately fails and exposes the limitations of U.S. military power and the complexities of Mexican nationalism.",
    "country1": "United States",
    "country2": "Mexico",
    "_id": "66a54856b924215aabf43c51"
  },
  {
    "year": "1916",
    "text": "President Wilson and Venustiano Carranza agree to a Joint High Commission, leading to the withdrawal of U.S. troops from Mexican territory, attempting to stabilize relations post-Villa expedition.",
    "country1": "United States",
    "country2": "Mexico",
    "_id": "66a54856b924215aabf43c52"
  },
  {
    "year": "1917",
    "text": "Venustiano Carranza is elected president of Mexico, representing a new phase in Mexican governance and a potential rebalancing of U.S.-Mexico relations.",
    "country1": "United States",
    "country2": "Mexico",
    "_id": "66a54856b924215aabf43c53"
  },
  {
    "year": "1917",
    "text": "The Zimmermann telegram is intercepted by the British and sent to the United States, swaying public opinion in favor of joining World War I and highlighting the ongoing geopolitical tensions in the region.",
    "country1": "United States",
    "country2": "Mexico",
    "_id": "66a54856b924215aabf43c54"
  },
  {
    "year": "1923",
    "text": "The Bucareli Agreement is signed, resolving some outstanding issues between the U.S. and Mexico regarding property rights and investments, reflecting an effort to stabilize relations after revolutionary turmoil.",
    "country1": "United States",
    "country2": "Mexico",
    "_id": "66a54856b924215aabf43c55"
  },
  {
    "year": "1933",
    "text": "The 'Good Neighbor Policy' is implemented by U.S. President Franklin Delano Roosevelt, aiming to improve diplomatic relations with Latin America and reduce military interventions, marking a significant shift in U.S. foreign policy.",
    "country1": "United States",
    "country2": "Mexico",
    "_id": "66a54856b924215aabf43c56"
  },
  {
    "year": "1934",
    "text": "-1940 Lázaro Cárdenas expropriates and redistributes more than six million acres of U.S.-owned property in Mexico during his presidency, reflecting a nationalist agenda that strains relations with the United States.",
    "country1": "United States",
    "country2": "Mexico",
    "_id": "66a54856b924215aabf43c57"
  },
  {
    "year": "1938",
    "text": "Cárdenas nationalizes Mexico's petroleum sector, further escalating tensions with U.S. oil companies and leading to diplomatic protests from the U.S. government.",
    "country1": "United States",
    "country2": "Mexico",
    "_id": "66a54856b924215aabf43c58"
  },
  {
    "year": "1938",
    "text": "Roosevelt pushes U.S. owners of oil companies to end their boycott of Mexican crude oil and accept adequate compensation for repossessed properties, illustrating the complexities of economic diplomacy.",
    "country1": "United States",
    "country2": "Mexico",
    "_id": "66a54856b924215aabf43c59"
  },
  {
    "year": "1939",
    "text": "Mexico stops trading with Germany as World War II begins, aligning more closely with the Allies and showcasing the geopolitical realignments occurring in the Americas.",
    "country1": "United States",
    "country2": "Mexico",
    "_id": "66a54856b924215aabf43c5a"
  },
  {
    "year": "1940",
    "text": "Mexico stops trading with Italy and Japan, further distancing itself from Axis powers and solidifying its stance as a partner to the United States.",
    "country1": "United States",
    "country2": "Mexico",
    "_id": "66a54856b924215aabf43c5b"
  },
  {
    "year": "1941",
    "text": "Mexican President Manuel Ávila Camacho severs relations with Japan, Germany, and Italy after the attack on Pearl Harbor, aligning Mexico firmly with U.S. interests during the war.",
    "country1": "United States",
    "country2": "Mexico",
    "_id": "66a54856b924215aabf43c5c"
  },
  {
    "year": "1942",
    "text": "Mexico declares war on the Axis powers, officially joining the Allies and participating in the broader conflict, which further strengthens ties with the United States.",
    "country1": "United States",
    "country2": "Mexico",
    "_id": "66a54856b924215aabf43c5d"
  },
  {
    "year": "1942",
    "text": "The Bracero Program starts, allowing Mexican agricultural workers to work temporarily in the U.S., creating a significant labor relationship that has lasting implications for both countries.",
    "country1": "United States",
    "country2": "Mexico",
    "_id": "66a54857b924215aabf43c5e"
  },
  {
    "year": "1945",
    "text": "The Mexican expeditionary fighter squadron “Aztec Eagles” gives aid to U.S. efforts in the Philippines, highlighting Mexico's military cooperation with the United States during World War II.",
    "country1": "United States",
    "country2": "Mexico",
    "_id": "66a54857b924215aabf43c5f"
  },
  {
    "year": "1941",
    "text": "-1945 Approximately 250,000 Mexicans and a million Mexican Americans serve in the U.S. armed forces during World War II, showcasing the deep ties and shared sacrifices between the nations.",
    "country1": "United States",
    "country2": "Mexico",
    "_id": "66a54857b924215aabf43c60"
  },
  {
    "year": "1947",
    "text": "-1948 Some 300,000 U.S. tourists visit Mexico annually, reflecting the growing cultural and economic exchanges that characterize post-war relations.",
    "country1": "United States",
    "country2": "Mexico",
    "_id": "66a54857b924215aabf43c61"
  },
  {
    "year": "1961",
    "text": "Mexican leaders praise the Cuban Revolution and refuse to sever diplomatic ties with Castro's government, despite pressure from U.S. President John F. Kennedy, indicating a complex political relationship influenced by Cold War dynamics.",
    "country1": "United States",
    "country2": "Mexico",
    "_id": "66a54857b924215aabf43c62"
  },
  {
    "year": "1964",
    "text": "The Bracero program ends, leading to changes in labor dynamics as undocumented immigration begins to rise significantly in the following decades.",
    "country1": "United States",
    "country2": "Mexico",
    "_id": "66a54857b924215aabf43c63"
  },
  {
    "year": "1965",
    "text": "The U.S. introduces the Immigration and Nationality Act, changing how immigration quotas are managed, reflecting ongoing concerns about immigration from Mexico.",
    "country1": "United States",
    "country2": "Mexico",
    "_id": "66a54857b924215aabf43c64"
  },
  {
    "year": "1968",
    "text": "The United States backs the Institutional Revolutionary Party during the Tlatelolco Massacre, leading to criticism of U.S. interference in Mexican internal politics and human rights issues.",
    "country1": "United States",
    "country2": "Mexico",
    "_id": "66a54857b924215aabf43c65"
  },
  {
    "year": "1969",
    "text": "U.S. President Richard Nixon launches Operation Intercept, causing U.S. customs officials to begin searching each and every border-crossing vehicle for drugs, marking a significant escalation in drug enforcement efforts.",
    "country1": "United States",
    "country2": "Mexico",
    "_id": "66a54857b924215aabf43c66"
  },
  {
    "year": "1973",
    "text": "The Drug Enforcement Administration (DEA) is established in the U.S. to coordinate drug enforcement efforts, reflecting a growing concern over drug trafficking from Mexico.",
    "country1": "United States",
    "country2": "Mexico",
    "_id": "66a54857b924215aabf43c67"
  },
  {
    "year": "1975",
    "text": "The Mexican government begins Operation Condor in an effort to eradicate and interdict drugs, showcasing Mexico's attempts to address drug-related violence and trafficking.",
    "country1": "United States",
    "country2": "Mexico",
    "_id": "66a54857b924215aabf43c68"
  },
  {
    "year": "1980",
    "text": "The Guadalajara cartel, one of the first major Mexican drug cartels, is formed, marking a new phase in drug trafficking that will heavily impact U.S.-Mexico relations.",
    "country1": "United States",
    "country2": "Mexico",
    "_id": "66a54857b924215aabf43c69"
  },
  {
    "year": "1982",
    "text": "Mexico signs an agreement with the International Monetary Fund to reschedule debt payments, opening foreign trade and investment, which affects economic relations with the U.S.",
    "country1": "United States",
    "country2": "Mexico",
    "_id": "66a54857b924215aabf43c6a"
  },
  {
    "year": "1983",
    "text": "U.S. leaders grudgingly accept Mexican support for Nicaragua's Sandinista government and lead efforts to find peaceful resolutions to conflicts in the region, highlighting geopolitical tensions in Central America.",
    "country1": "United States",
    "country2": "Mexico",
    "_id": "66a54857b924215aabf43c6b"
  },
  {
    "year": "1985",
    "text": "DEA agent Enrique 'Kiki' Camarena is kidnapped, tortured, and murdered by the Guadalajara Cartel, leading to increased U.S.-Mexico cooperation on drug enforcement as a response to growing violence.",
    "country1": "United States",
    "country2": "Mexico",
    "_id": "66a54857b924215aabf43c6c"
  },
  {
    "year": "1989",
    "text": "The U.S. begins the certification process, evaluating countries' efforts in combating drug trafficking. Non-cooperative countries risk losing U.S. aid and trade benefits, placing pressure on Mexico to cooperate.",
    "country1": "United States",
    "country2": "Mexico",
    "_id": "66a54857b924215aabf43c6d"
  },
  {
    "year": "1986",
    "text": "The Immigration and Reform Control Act allocates new resources to the Border Patrol, sanctions U.S. employers who hire illegal workers, and offers amnesty legalization to long-term undocumented residents and agricultural workers, reshaping immigration policy.",
    "country1": "United States",
    "country2": "Mexico",
    "_id": "66a54857b924215aabf43c6e"
  },
  {
    "year": "1994",
    "text": "The North American Free Trade Agreement (NAFTA) is enacted, deepening U.S. and Mexican economic ties and creating a trilateral trade bloc with Canada, significantly impacting trade flows and labor dynamics.",
    "country1": "United States",
    "country2": "Mexico",
    "_id": "66a54857b924215aabf43c6f"
  },
  {
    "year": "1994",
    "text": "California adopts Proposition 187, denying undocumented residents access to nearly all public services, including schools and hospitals, reflecting rising anti-immigrant sentiment in the U.S. and straining relations with Mexico.",
    "country1": "United States",
    "country2": "Mexico",
    "_id": "66a54857b924215aabf43c70"
  },
  {
    "year": "1996",
    "text": "Congress passes the Illegal Immigration Reform and Immigrant Responsibility Act of 1996, tightening immigration laws and enforcement, which impacts Mexican nationals and the bilateral relationship.",
    "country1": "United States",
    "country2": "Mexico",
    "_id": "66a54857b924215aabf43c71"
  },
  {
    "year": "1996",
    "text": "Mexico passes the 1996 Constitutional Amendment on Dual Nationality, reflecting changing attitudes towards immigration and the Mexican diaspora in the United States.",
    "country1": "United States",
    "country2": "Mexico",
    "_id": "66a54858b924215aabf43c72"
  },
  {
    "year": "1997",
    "text": "General Jesús Gutiérrez Rebollo, Mexico's top anti-drug official, is arrested for protecting a cartel leader, highlighting issues of corruption within Mexican law enforcement and complicating cooperation with U.S. agencies.",
    "country1": "United States",
    "country2": "Mexico",
    "_id": "66a54858b924215aabf43c73"
  },
  {
    "year": "2000",
    "text": "Marking the end of 71 years of Institutional Revolutionary Party rule, Vicente Fox is elected President of Mexico, promising to combat drug cartels and reform U.S.-Mexico relations, signaling a potential shift in bilateral dynamics as the new century approaches.",
    "country1": "United States",
    "country2": "Mexico",
    "_id": "66a54858b924215aabf43c74"
  }
]