[
  {
    "year": "1821",
    "text": "Mexico gains independence from Spain",
    "_id": "66648bff3933f6e325d3deba"
  },
  {
    "year": "1822",
    "text": "Joel Robert Poinsett embarks on a special mission to Mexico, publishing an account of his experiences in 'Notes on Mexico'",
    "_id": "66648c233933f6e325d3debb"
  },
  {
    "year": "1823",
    "text": "The United States recognizes Mexico as an independent nation",
    "_id": "66648c383933f6e325d3debc"
  },
  {
    "year": "1823",
    "text": "United States president James Monroe articulates the Monroe Doctrine in his seventh annual message to Congress",
    "_id": "66648c483933f6e325d3debd"
  },
  {
    "year": "1824",
    "text": "Joel Robert Poinsett is appointed first U.S. minister to Mexico",
    "_id": "66648c603933f6e325d3debe"
  },
  {
    "year": "1825",
    "text": "Over several years, empresario Stephen F. Austin attracts the first 300 American families into the Coahuilas y Tejas territory",
    "_id": "66648c743933f6e325d3debf"
  },
  {
    "year": "1826",
    "text": "American empresario Haden Edwards leads Fredonian Rebellion in an attempt to secede from Mexico",
    "_id": "66648c903933f6e325d3dec0"
  },
  {
    "year": "1829",
    "text": "Mexico abolishes slavery",
    "_id": "66648cab3933f6e325d3dec1"
  },
  {
    "year": "1830",
    "text": "Mexican-owned Tejas is home to roughly 20,000 Americans",
    "_id": "66648cc73933f6e325d3dec2"
  },
  {
    "year": "1830",
    "text": "Mexico prohibits immigration to Tejas from the United States in an effort to stop the influx of English-speaking settlers",
    "_id": "66648ce13933f6e325d3dec3"
  },
  {
    "year": "1835",
    "text": "American immigrants and Tejanos lead the Texas Revolution on behalf of the Tejas province of Mexico as part of a larger Mexican Federalist's War",
    "_id": "66648d013933f6e325d3dec4"
  },
  {
    "year": "1836",
    "text": "The Battle of the Alamo",
    "_id": "66648d153933f6e325d3dec5"
  },
  {
    "year": "1836",
    "text": "An independent Republic of Texas is declared during the Texas Convention",
    "_id": "66648d2d3933f6e325d3dec6"
  },
  {
    "year": "1836",
    "text": "Santa Anna surrenders after defeat in Battle of San Jacinto; Treaties of Valasco unofficially marks Rio Grande as the border between Mexico and the Republic of Texas",
    "_id": "66648d423933f6e325d3dec7"
  },
  {
    "year": "1838",
    "text": "Mexico defends itself successfully from French invasion during the 'Pastry War'; Santa Anna's role helps him regain popularity",
    "_id": "66648d5f3933f6e325d3dec8"
  },
  {
    "year": "1841",
    "text": "Santa Anna returns to the Mexican presidency, ordering the military to pressure the Mexican-Texas border",
    "_id": "66648d7c3933f6e325d3dec9"
  },
  {
    "year": "1842",
    "text": "San Antonio is taken and returned several times; a back-and-forth of Mexican militants and Tejanos crossing the border for raids and returning to Mexico continues",
    "_id": "66648d8f3933f6e325d3deca"
  },
  {
    "year": "1845",
    "text": "Expansionist Democrat James K. Polk becomes U.S. President",
    "_id": "66648da03933f6e325d3decb"
  },
  {
    "year": "1845",
    "text": "Mexico refuses to negotiate the acceptance of Texas' annexation into the United States",
    "_id": "66648dbe3933f6e325d3decc"
  },
  {
    "year": "1845",
    "text": "Republic of Texas annexed into the United States as the 28th state",
    "_id": "66648dd73933f6e325d3decd"
  },
  {
    "year": "1846",
    "text": "President James K. Polk orders General Zachary Taylor to occupy disputed territory between the Nueces and Rio Grande rivers",
    "_id": "66648def3933f6e325d3dece"
  },
  {
    "year": "1846",
    "text": "Mexican troops at Matamoros cross the Rio Grande and ambush an American patrol, which President Polk declares an act of war",
    "_id": "66648e093933f6e325d3decf"
  },
  {
    "year": "1846",
    "text": "Mexican-American War begins",
    "_id": "66648e3a3933f6e325d3ded0"
  },
  {
    "year": "1847",
    "text": "The United States army marches towards Mexico City from the north while the United States navy takes Veracruz via amphibious assault",
    "_id": "66648e563933f6e325d3ded1"
  },
  {
    "year": "1847",
    "text": "The United States army takes and occupies Mexico City",
    "_id": "66648e723933f6e325d3ded2"
  },
  {
    "year": "1848",
    "text": "The Treaty of Guadalupe Hidalgo is signed, ending the Mexican-American War",
    "_id": "66648e8e3933f6e325d3ded3"
  },
  {
    "year": "1854",
    "text": "Gadsden Purchase is finalized and signed, forming the current day borders between the United States and Mexico",
    "_id": "66648ea83933f6e325d3ded4"
  },
  {
    "year": "1861-1867",
    "text": "Invoking the Monroe Doctrine, the United States provides diplomatic and material support to Mexico during the French Intervention in Mexico",
    "_id": "66648ebf3933f6e325d3ded5"
  },
  {
    "year": "1870s-1890s",
    "text": "Mexico encourages repatriation of Mexican-Americans back into its northern territories",
    "_id": "66648ed13933f6e325d3ded6"
  },
  {
    "year": "1876",
    "text": "Porfirio Díaz seizes power in Mexico with the financial support of U.S. entrepreneurs from South Texas",
    "_id": "66648ee73933f6e325d3ded7"
  },
  {
    "year": "1884-1990s",
    "text": "The Porfiriato government strengthens U.S. - Mexico economic ties through mining and railroad investments",
    "_id": "66648efb3933f6e325d3ded8"
  },
  {
    "year": "1910-1917",
    "text": "Discontent with the Porfiriato leads to Mexican Revolution, U.S. involvement and interventions strain relations",
    "_id": "66648f183933f6e325d3ded9"
  },
  {
    "year": "1913",
    "text": "'Pact of the Embassy' brokered by US ambassador Henry Lane Wilson to Mexico, leading to Francisco Madero's assassination and Victoriano Huerta's ascension to Mexican presidency",
    "_id": "66648f2f3933f6e325d3deda"
  },
  {
    "year": "1913",
    "text": "Woodrow Wilson elected President of the United States and embargoes weapons and supplies to Huerta's Mexican Federalist troops",
    "_id": "66648f453933f6e325d3dedb"
  },
  {
    "year": "1914",
    "text": "President Wilson sends US marines to occupy Mexico's port of Veracruz, heightening tensions between the two countries",
    "_id": "66648f5d3933f6e325d3dedc"
  },
  {
    "year": "1916",
    "text": "President Wilson orders the Pancho Villa Expedition, which ultimately fails",
    "_id": "66648f7c3933f6e325d3dedd"
  },
  {
    "year": "1916",
    "text": "President Wilson and Venustiano Carranza agree to a Joint High Commission, leading to the withdrawal of US troops from Mexican territory",
    "_id": "66648f903933f6e325d3dede"
  },
  {
    "year": "1917",
    "text": "Venustiano Carranza elected president of Mexico",
    "_id": "66648faa3933f6e325d3dedf"
  },
  {
    "year": "1917",
    "text": "Zimmermann telegram is intercepted by the British and sent to the United States, swaying public opinion in favor of joining the World War",
    "_id": "66648fc33933f6e325d3dee0"
  },
  {
    "year": "1923",
    "text": "Bucareli Agreement of 1923",
    "_id": "66648fe63933f6e325d3dee1"
  },
  {
    "year": "1933",
    "text": "'Good Neighbor Policy' implemented by US President Franklin Delano Roosevelt",
    "_id": "66648ff93933f6e325d3dee2"
  },
  {
    "year": "1934-1940",
    "text": "Lázaro Cárdenas expropriates and redistributes more than six million acres of U.S.-owned property in Mexico during his presidency",
    "_id": "666490143933f6e325d3dee3"
  },
  {
    "year": "1938",
    "text": "Cárdenas nationalizes Mexico's petroleum sector",
    "_id": "666490323933f6e325d3dee4"
  },
  {
    "year": "1938",
    "text": "Roosevelt pushes US owners of oil companies to end their boycott of Mexican crude oil and accept adequate compensation for repossessed properties",
    "_id": "6664904c3933f6e325d3dee5"
  },
  {
    "year": "1939",
    "text": "Mexico stops trading with Germany",
    "_id": "6664905f3933f6e325d3dee6"
  },
  {
    "year": "1940",
    "text": "Mexico stops trading with Italy and Japan",
    "_id": "666490703933f6e325d3dee7"
  },
  {
    "year": "1941",
    "text": "Mexican President Manuel Ávila Camacho severs relations with Japan, Germany, and Italy after the attack on Pearl Harbor",
    "_id": "666490863933f6e325d3dee8"
  },
  {
    "year": "1942",
    "text": "Mexico declares war on the Axis powers",
    "_id": "666490a43933f6e325d3dee9"
  },
  {
    "year": "1942",
    "text": "Bracero Program starts, allowing Mexican agricultural workers to work temporarily in the US",
    "_id": "666490b83933f6e325d3deea"
  },
  {
    "year": "1945",
    "text": "Mexican expeditionary fighter squadron “Aztec Eagles” gives aid to US efforts in the Philippines",
    "_id": "666490cb3933f6e325d3deeb"
  },
  {
    "year": "1941-1945",
    "text": "250,000 Mexicans and a million Mexican Americans serve in the U.S. armed forces during WW2",
    "_id": "666490ea3933f6e325d3deec"
  },
  {
    "year": "1947-1948",
    "text": "Some 300,000 U.S. tourists visit Mexico annually",
    "_id": "666490fe3933f6e325d3deed"
  },
  {
    "year": "1961",
    "text": "Mexican leaders praise the Cuban Revolution and refuse to sever diplomatic ties with Castro's government, despite pressure from the US President John F Kennedy",
    "_id": "666491163933f6e325d3deee"
  },
  {
    "year": "1964",
    "text": "Bracero program ends",
    "_id": "6664912e3933f6e325d3deef"
  },
  {
    "year": "1965",
    "text": "The U.S. introduces the Immigration and Nationality Act, changing how immigration quotas are managed",
    "_id": "666491453933f6e325d3def0"
  },
  {
    "year": "1968",
    "text": "United States backs the Institutional Revolutionary Party during the Tlatelolco Massacre",
    "_id": "666491613933f6e325d3def1"
  },
  {
    "year": "1969",
    "text": "US President Richard Nixon launches Operation Intercept, causing US customs officials to begin searching each and every border-crossing vehicle for drugs",
    "_id": "666491763933f6e325d3def2"
  },
  {
    "year": "1973",
    "text": "Drug Enforcement Administration is established in the US to coordinate drug enforcement efforts",
    "_id": "6664918d3933f6e325d3def3"
  },
  {
    "year": "1975",
    "text": "Mexican government begins Operation Condor in an effort to eradicate and interdict drugs",
    "_id": "666491a73933f6e325d3def4"
  },
  {
    "year": "1980",
    "text": "Guadalajara cartel, one of the first major Mexican drug cartels, is formed",
    "_id": "666491be3933f6e325d3def5"
  },
  {
    "year": "1982",
    "text": "Mexico signs agreement with the International Monetary Fund to reschedule debt payments, opening foreign trade and investment",
    "_id": "666491da3933f6e325d3def6"
  },
  {
    "year": "1983",
    "text": "US leaders grudgingly accept Mexican support for Nicaragua's Sandinista government and lead efforts to find peaceful resolutions to conflicts in the region",
    "_id": "666491ef3933f6e325d3def7"
  },
  {
    "year": "1985",
    "text": "DEA agent Enrique 'Kiki' Camarena is kidnapped, tortured, and murdered by the Guadalajara Cartel, leading to increased U.S.-Mexico cooperation on drug enforcement",
    "_id": "666492023933f6e325d3def8"
  },
  {
    "year": "1989",
    "text": "The US begins the certification process, evaluating countries' efforts in combating drug trafficking. Non-cooperative countries risk losing US aid and trade benefits",
    "_id": "666492193933f6e325d3def9"
  },
  {
    "year": "1986",
    "text": "Immigration and Reform Control Act allocates new resources to the Border Patrol, sanctions US employers who hire illegal workers, and offers amnesty legalization to long-term undocumented residents and agricultural workers",
    "_id": "6664922e3933f6e325d3defa"
  },
  {
    "year": "1994",
    "text": "North American Free Trade Agreement, or NAFTA, deepens US and Mexican economic ties",
    "_id": "666492433933f6e325d3defb"
  },
  {
    "year": "1994",
    "text": "California adopts Proposition 187, denying undocumented residents access to nearly all public services, including schools and hospitals",
    "_id": "6664925c3933f6e325d3defc"
  },
  {
    "year": "1996",
    "text": "Congress passes the Illegal Immigration Reform and Immigrant Responsibility Act of 1996",
    "_id": "666492823933f6e325d3defd"
  },
  {
    "year": "1996",
    "text": "Mexico passes the 1996 Constitutional Amendment on Dual Nationality",
    "_id": "666492a53933f6e325d3defe"
  },
  {
    "year": "1997",
    "text": "General Jesús Gutiérrez Rebollo, Mexico's top anti-drug official, is arrested for protecting a cartel leader, highlighting corruption issues",
    "_id": "666492bc3933f6e325d3deff"
  },
  {
    "year": "2000",
    "text": "Marking the end of 71 years of Institutional Revolutionary Party rule, Vicente Fox is elected President of Mexico, promising to combat drug cartels",
    "_id": "666492ce3933f6e325d3df00"
  }
]
